import task from "./task1.png";
import schema from "./schema.png"
import result from "./res1.png";
import result2 from "./res2.png";

const Content1 = () => (
<div className="content" >
        <div className="content" id="meta">
            <h3>Лабораторна робота №1</h3>
            <h4>Тема: Типи даних. Функції введення - виведення. Обчислення виразів</h4>
            <ul><h4>Мета роботи:</h4>
             <li>Вивчити особливості використання  вбудованих типів даних</li>
            <li>Вивчити особливості використання функцій введення - виведення</li>
            <li>Навчитися застосовувати стандартні математичні функції</li>
            </ul>
        </div>

        <div className="content" id="task">
        <h4>Варіант №17</h4>
        <ul><h4>Умова завдання</h4>
            <li>Увести з клавіатури і вивести на екран значення змінних різних типів згідно з форматами даних (форматне введення-виведення) і без використання форматів. Використати всі функції, що приведені у таблиці</li>
            <li>Визначити  розбіжності  у  використанні функцій введення - виведення</li>
            <li>За даними, що  введені з клавіатури в оперативну пам’ять, визначити значення  виразу, використовуючи математичні функції, і вивести результат на екран. Вираз вибрати згідно з варіантом по таблиці 1.7. Значення змінних A,B,C,D задати самостійно.</li>
        </ul>
        <img src={task} alt="task"/>
        </div>
        
        <div className="content" id="analize">
        <h4>Аналіз задачі, теоретичні обгрунтування вибраного методу вирішення задачі,<br/> розрахункові формули, посилання на літературні джерела.</h4>

        <p>Для отримання аргументів для функції від користувача та виконання дій над даними нам необхідно їх ввести з клавіатури.<br/> Для цього будемо використовувати стандартний потік вводу stdin.<br/> Для відображення результатів на екрані нам необхідно застосовувати стандартний потік виводу stdout.</p>
        <p>Щоб отримати від користувача введене їм значення використовується  об'єкт классу istream - cin, а щоб виводити дані в термінал користувача об'єкт класу ostream - cout.</p>

        <p>Також для обчислення значення Х, нам буде потрібна математична функція log для обчислення натурального логарифму всередині виразу.</p>
        <p>Джерелом інформаціїї для розв'язання була Теоретична частина завдання.</p>
        </div>   

        <div className="content" id="descr">
            <h4>Опис алгоритму розв'язання задачі.</h4>
            <div>
            <ul>
                <li>Створюємо змінні a,b,c,d для вхідних даних, та х для результату</li>
                <li> Отримуємо значення a з клавіатури</li>
                <li> Отримуємо значення b з клавіатури</li>
                <li> Отримуємо значення c з клавіатури</li>
                <li> Отримуємо значення d з клавіатури</li>
                <li> Обчислюємо значення x за приведною формулою</li>
                <li>Виводимо результат значення х</li>
            </ul>
            </div>
        </div>

        <div className="content" id="schema">
            <h4>Блок-схема алгоритму програми</h4>
            <img src={schema} alt="schema"/>
        </div>

        <div className="content" id="code">
        <h4>Текст програми</h4>
            <div className="example"> 
                {`#include <iostream>`}<br/>
                {`#include <math.h>`}<br/>
                {`using namespace std;`}<br/>

                {`int main()`}<br/>
                {`{`}<br/>
                {`double x, a, b, c, d;`}<br/>
                {`cout << "a = ";`}<br/>
                {`cin >> a;`}<br/>
                {`cout << "b = ";`}<br/>
                {`cin >> b;`}<br/>
                {`cout << "c = ";`}<br/>
                {`cin >> c;`}<br/>
                {`cout << "d = ";`}<br/>
                {`cin >> d;`}<br/>

                {`x = a / (1 + b / (c + log(d + a)));`}<br/>
                {`cout << "X = " << x;`}<br/>
                {`}`}<br/>
            </div>
        </div>

        <div className="content" id="result">
            <h4>Результати виконання програми</h4>
            <img src={result} alt="schema" width={500} height={150}/><br/><br/>
            <img src={result2} alt="schema" width={500} height={150}/>
        </div>

        <div className="content" id="check5">
            <h4>Аналіз достовірності результатів</h4>
            <p>Перевіряюмо отримані результати по наведеному вище першому прикладу:</p>
            <div> Маємо дані a= 3,b=5 c = 4, d =6. </div>
            <p>Підставляємо значення x = 3 / (1 + 5 / (4 + log(6 + 3)))</p>
            <p>x = 3 / (1 + 5 / (4 + 2.19722))</p>
            <p>x = 3 / (1 + 5 / 6.19722))</p>
            <p>x = 3 / (1+ 0.806813)</p>
            <p>x = 3 / 1.80681</p>
            <p>x = 1.66038</p>
            <p>Розрахунок правильній.</p>
        </div>

        <div className="content" id="summary">
            <h4>Висновки</h4>
            <ul>Виконавши дану лабораторну роботу, ми навчилися:
                <li>Використовувати   вбудованих типів даних: char,  int,  long, short, float, double, unsigned char, unsigned int, unsigned long</li>
                <li> Використанню функцій введення - виведення, а також їх особливості</li>
                <li>Застосовувати стандартні математичні функції</li>
            </ul>
        </div>

        <div className="content" id="answers">
            <h4>Відповіді на контрольні питання</h4>
            <h5>1.Як визначаються коментарі у програмному коді? </h5>
            <p>/* */	- містять коментар, що розміщується на декількох рядках;<br/>
                //	- коментар, що розміщується в одному рядку, використовується в С++.</p>
            <h5>2.Яка різниця між введенням даних з консолі та із стандартного вхідного потоку? </h5>
            <p>Якщо із стандартного вхідного потоку, то під час компіляції, дані вже прописані, і ми не можемо на них вплинути, вручну, на відмінно від вводу з консолі.</p>
            <h5>3.Яка різниця між виведенням даних на консоль та у стандартний вихідний потік? </h5>
            <p>Якщо виводити у стандартний вихідний потік, то ці дані будуть збережені в пам'яті, але прочитати ми їх не зможемо, на відмінно від вводу з консолі.</p>
            <h5>4.Які функції повертають значення EOF при неуспішному виконання операцій введення та виведення? </h5>
            <p>Функція EOF повертає значення FALSE.</p>
            <h5>5.Які функції можуть виконувати операції перетворення типів даних?</h5>
            <p>У C розрізняють явне і неявне перетворення типів даних. Неявне перетворення типів даних виконує компілятор С , ну а явне перетворення даних виконує сам програміст.</p>
            <h5>6.Які функції використовують форматний ввід та вивід? Як кодуються формати введення та виведення? </h5>
            <p>Для потокового введення даних вказується операція {`«>>»`} («читати з»). Це перевантажена операція, визначена для всіх простих типів і покажчика на char.<br/> Стандартним потоком введення є cin.
                Формат запису операції введення має вигляд:
                {`сin [>> values]`};<br/>
                Для потокового виведення даних необхідна операція {`«<<»`} («записати в»), що використовується разом з ім’ям вихідного потоку cout. Наприклад, вираз
                cout {`<<`} х;</p>
            <h5>7.Які заголовні файли використовуються для визначення функцій введення та виведення даних? </h5>
            <p>stdio.h (від англ. standard input/output header — заголовний файл стандартного вводу/виводу), хоча більшою популярністю користується бібліотека "iostream".</p>
            <h5>8.Як і для чого виконується очищення буферу клавіатури?</h5>
            <p>Трапляється, що при введенні в буфер консолі залишається сміття, тому для очистки визивається функція cin.ignore().</p>
            <h5>9.Як можна вводити дані без відображення їх на екрані? </h5>
            <p>getch() – введення одного символу без відображення його на екрані</p>
            <h5>10.Які операції використовуються для введення та виведення даних за допомогою об’єктів класів потоків?</h5>
            <p>За допомогою операцій {`>>`} та {`<<`} можна вводити та виводити дані стандартних типів та типів, визначених користувачем. Для введення або виведення об'єктів (з типом класу) необхідно виконати перевантаження операцій {`>>`} або {`<<`}. </p>
        </div>    
</div>
);

export default Content1;
