import AceEditor from "react-ace";
import algorithm from "../constants/algorithm";
import result from "../static/lab8result.png"
import matrix from "../static/ll8.png";

const Content8 = () => (
<div className="content">
        <div id="meta8" className="content">
            <h3>Лабораторна робота №8</h3>
            <h4>Тема: Багатовимірні масиви</h4>
            <ul><h4>Мета роботи:</h4>
             <li>Ознайомитися з особливостями багатовимірних масивів</li>
            <li>Опанувати технологію застосування багатовимірних масивів даних</li>
            <li>Навчитися розробляти алгоритми та програми із застосуванням багатовимірних масивів</li>
            </ul>
        </div>

        <div className="content" id="task8">
        <h4>Варіант №17</h4>
        <h4>Умова завдання</h4>
        <p>Задати матрицю довільної вимірності та вектор. <br/>Визначити транспоновану матрицю та здійснити множення матриці на вектор.</p>
        </div>

        <div className="content" id="analize8">
            <h4>Аналіз задачі, теоретичні обгрунтування вибраного методу вирішення задачі,<br/> розрахункові формули, посилання на літературні джерела.</h4>
        <p>Транспонована матриця — це матриця A^T, що виникає з матриці A в результаті унарної операції транспонування: заміни її рядків на стовпчики.</p>
        <img src={matrix} alt="schema" width={200}/>
        <p>Множення матриці на вектор проводиться за правилом «рядок на стовпець».<br/> При множенні матриці на вектор-стовпчик число стовпців у матриці має співпадати з числом рядків у векторі-стовпці.<br/> Результатом множення матриці на вектор-стовпець є вектор-стовпець</p>
        </div>
         
        <div className="content" id="descr7">
            <h4>Опис алгоритму розв'язання задачі.</h4>
            <div>
            <ul>
                <li>Створюємо матрицю М та вектор v</li>
                <li>Заповнюємо вектор v числами з консолі</li>
                <li>Заповнюємо матрицю М числами</li>
                <ul>Виконуємо функцію транспонування матриці
                    <li>Створюємо нову матрицю tmp такого ж розміру</li>
                    <ul>Проходимось по елементам матриці M 
                       <li>Кожний елемент прирівнюємо до елемента нової матриці tmp <br/> зі значенням індексу і рядку у зоротньому порядку </li>
                       <li>Виводимо результат</li>
                    </ul>
                </ul>    
                <ul>Виконуємо функцію множення матриці M на вектор v 
                    <li>Створюємо новий вектор res</li>
                       <li>Створюємо змінну для значення по індексу визначеного ряду tmp</li>
                       <ul>Проходимось по елементам матриці M 
                            <li>В кожному рядку множимо значення матриці на значення вектора з такої ж колонки</li> 
                            <li>Сумуємо значення кожної колонки в tmp</li>
                            <li>Присвоюємо значення tmp до відповідної колонки значення res</li>
                        </ul>
                         <li>Виводимо отриманий вектор res</li>
                    </ul>
                </ul>
            </div>   
        </div> 

        <div className="content" id="code8">
        <h4>Текст програми</h4>
        <AceEditor
            mode="html"
            value={algorithm}
            theme="github"
            name="task32"
            editorProps={{ $blockScrolling: true }}
            />
        </div>

        
        <div className="content" id="result8">
            <h4>Результати виконання програми</h4>
            <img src={result} alt="schema"/>
        </div>


        <div className="content" id="check8">
            <h4>Аналіз достовірності результатів</h4>
            <div> Маємо дані v =[3,4,5], M = [[0,1,2],[3,4,5],[6,7,8]]. 
                <p>Транспонуємо матрицю - змінюємо індекси рядів і колонок місцями: </p>
                <p>M =[[0,3,6] [1,4,7], [2,5,8]]</p>
                 <p>Перемножуємо вектор та матрицю:</p>
                 Для цього множимо кожне значення ряда матриці на відповідне значення ряда вектора та смуємо значення.
                 0 * 4 + 3 * 4 + 6* 5 = 42
                 1*3 + 4*4 + 7 * 5 = 54
                 2 * 3 + 5 * 4 + 8 * 5 = 66
                 Відповідь : [42, 54, 66]

                 Значення вірне!</div>
        </div>

        <div className="content" id="summary8">
            <h4>Висновки</h4>
            <ul>Виконавши дану лабораторну роботу, ми:
                <li>Вивчили особливості роботи з багатовимірними масивівами даних</li>
                <li>Навчитися розробляти алгоритми та програми із застосуванням багатовимірних масивів, <br/>на прикладі операції з матрицею та вектором</li>
            </ul>
        </div>

        <div className="content" id="answers8">
        <h4>Відповіді на контрольні питання</h4>
        <h4>Дати означення матриці.</h4>
        <p>Матриця – це двовимірний масив, кожен елемент якого має два індекси: номер рядка та номер стовпця, <br/>тому для роботи з елементами матриці необхідно використовувати два цикли.</p>
        <h4>Як зображується матриця в оперативній пам’яті?</h4>
        <p>Оперативна пам’ять має лінійну структуру.  Спочатку у послідовних комірках записуються всі елементи першого рядка,  <br/> потім у подальших послідовних комірках елементи другого рядка і т.д., поки не буде вичерпано всі елементи</p>
        <h4>Як здійснити доступ до елементів масиву чи матриці?</h4>
        <p>Звернутися до масиву з індексом значходження елемента, коли мова йде про матриці то з індексом рядка та стовпчика елемента</p>
        <h4>Як здійснити доступ до елемента матриці, користуючись значенням тільки одного індексу?</h4>
        <p>З одним індексом ми матимемо доступ тільки до рядка, щоб знайти конкретний елемент треба буде робити перебір елементів</p>
        <h4>Означити типові операції над матрицями</h4>
        <ul>Перелік базових операцій над матрицями та їх елементами:
            <li>створення нової матриці за заданим алгоритмом;</li>
            <li>введення та виведення матриць;</li>
            <li>пошук елементів матриці за певним критерієм;</li>
           <li>визначення, чи задовольняє матриця або окремі її елементи певній властивості;</li>
            <li>виконання певних операцій над компонентами матриць (переставлення рядків і стовпців, множення матриць тощо).</li>
        </ul>
        </div>
</div>
);

export default Content8;
