import task from "../static/task2.png";
import schema from "../static/schema2.png";
import result from "../static/res3.png";
import result2 from "../static/res32.png";
import result3 from "../static/res33.png";
import result4 from "../static/res34.png";

const Content2 = () => (
    <div className="content" >
        <div className="content" id="meta2">
            <h3>Лабораторна робота №2</h3>
            <h4>Тема: Розгалужені обчислювальні процеси</h4>
            <ul><h4>Мета роботи:</h4>
                <li>Вивчити особливості розгалужених обчислювальних процесів</li>
                <li>Опанувати технологію використання логічних операторів</li>
            </ul>
        </div>

        <div className="content" id="task2">
            <h4>Варіант №17</h4>
            <h4>Умова завдання</h4>
            <img src={task} alt="task"/>
        </div>

        <div className="content" id="analize2">
        <h4>Аналіз задачі, теоретичні обгрунтування вибраного методу вирішення задачі,<br/> розрахункові формули, посилання на літературні джерела.</h4>

        <p>Тому,що ми зіткнулися з складною розгалуженою умовою, краще за все для розв'язання задачі підійде використання конструкції if else  з додатковими умовами з допомогою else if.</p>
        </div>

        <div className="content" id="descr2">
            <h4>Опис алгоритму розв'язання задачі.</h4>
            <div>
            <ul>
                <li>Створюємо змінні Y = 0  та Х </li>
                <li>Отримуємо від користувача значення Х</li>
                <li> Якщо Х більший за 0 та меньший за 5 розраховуємо Y по перщій формулі</li>
                <li> Якщо Х дорівнює 5 розраховуємо Y по другій формулі</li>
                <li> Якщо Х більший за 5 розраховуємо Y по третій формулі</li>
                <li> Якщо Х меньший за 0 розраховуємо Y по четвертій формулі</li>
                <li>Виводимо результат значення Y</li>
            </ul>
            </div>
        </div>
        
        <div className="content" id="schema2">
            <h4>Блок-схема алгоритму програми</h4>
            <img src={schema} alt="schema" width={500}/>
        </div>

        <div className="content" id="code2">
                <h4>Текст програми</h4>
                <div className="example"> 
                            {` #include <iostream> `}<br/>
                            {` #include <math.h> `}<br/>
                            {` using namespace std; `}<br/>
                            {` int main() `}<br/>
                            {` { `}<br/>
                            {`  double Y = 0, x; `}<br/>
                            {` cout << "Введiть Х: "; `}<br/>
                            {` cin >> x; `}<br/>

                            {` if (0 < x && x < 5) Y = pow(x + 1, 2); `}<br/>
                            {` else if (x == 5) Y = pow(x - 1, 2); `}<br/>
                            {` else if (x > 5) Y = (x - 1) / (x + 1); `}<br/>
                            {` else if (x < 0) Y = (x - 1) * (x + 1); `}<br/>
                            {` cout << "\nY = " << Y << endl; `}<br/>
                            {` } `}<br/>
                </div>    
        </div>

        <div className="content" id="result2">
            <h4>Результати виконання програми</h4>
            <img src={result} alt="result" width={500} height={150}/><br/><br/>
            <img src={result2} alt="result" width={500} height={150}/><br/><br/>
            <img src={result3} alt="result" width={500} height={150}/><br/><br/>
            <img src={result4} alt="result" width={500} height={150}/><br/><br/>
        </div>

        <div className="content" id="check2">
            <h4>Аналіз достовірності результатів</h4>
            <p>Перевіряюмо отримані вище результати:</p>
            <p> 1. X = 4, тому, що {`0 <X <5`} виконується перша умова X+1^2 = 5^2=25 </p>
            <p> 1. X = 5, тому, що {`X === 5`} виконується друга умова X-1^2 = 4^2=16 </p>
            <p> 1. X = 10, тому, що {`X > 5`} виконується третя умова (X-1)/(Х+1)= (10-1)/(10+1)= 9/11 =0.818182 </p>
            <p> 1. X = -5, тому, що {`X <0`} виконується четверта умова(X-1)*(Х+1)=(-5-1)*(-5+1)= (-6)*(-4)=24 </p>
            <p>Розрахунок правильній.</p>
        </div>

        <div className="content" id="summary2">
            <h4>Висновки</h4>
            <ul>Виконавши дану лабораторну роботу, ми навчилися:
                <li>Використовувати   конструкції вибору if else  та умовний вираз «?»</li>
                <li>Також розглянули поліваріантний вибір з switch case</li>
            </ul>
        </div>

        <div className="content" id="answers2">
          
            <h4>Відповіді на контрольні питання</h4>

            <h5>Як формується складена умова, що об’єднує декілька простих умов? </h5>
            <p>Складена умова – дві або більше простих умови, з’єднаних знаком логічної операції (and, or, xor, not).</p>
            <h5>Наведіть синтаксис оператора одноальтернативного розгалуження. </h5>
            <p>Синтаксис оператора : if (умова) оператор1.</p>
            <h5>До яких типів даних не може належати значення виразу-селектора в операторі вибору?</h5>
            <p>Селектор повинен належати до одного з цілочисельних типів (що знаходяться в діапазоні - 32768..32767): булевскому, літерних або призначеному для користувача.</p>
            <h5>Яка структура працює ефективніше: вкладені оператори if...else чи серія операторів if? Відповідь обґрунтуйте.</h5>
            <p>Оскільки в разі використання серія операторів if буде перевірятись кожна умова, а в if...else буде лише до першої істинної, то друге буде ефективніше.</p>
            <h5>Чи можна перервати роботу програми за допомогою оператора break?</h5>
            <p>За допомогою оператора break можна перервати виконання блокового виразу з позначкою. У такому разі break повинен знаходитися всередині блоку коду із зазначеною міткою.</p>
            <h5>Чому в гілках оператора switch слід використовувати оператор break?</h5>
            <p>break використовується всередині циклів і оператора switch , щоб перейти в кінець блоку коду. Тобто програма виконує код до оператора break і як тільки виконається break,<br/> програма вийде з циклу або оператора switch. 
                У операторі switch , break пропускає всі інші case – це запобігає «провали» в інші гілки case.</p>
             <h5>Що таке умовний вираз і як він записується? </h5>
             <p>До операторів вибору відносять оператор умовного переходу if та оператор-перемикач switch.<br/> Оператор умовного переходу if використовується для розгалуження процесу обчислень на два напрямки і має такий формат запису:<br/>
                if (вираз) оператор 1;<br/>
                else<br/>
                оператор2;</p>
                <h5>Що працює ефективніше: умовний вираз чи оператор if...else?</h5>
                <p>Оператор if можна використовувати для більш складних умов з else if  або {`if (!(<умова1>) && <умова2>) <оператор2;></умова2>`}.</p>
        </div>    
    </div>    

);

export default Content2;
